{
   "class_name":"Functional",
   "config":{
      "name":"model_1",
      "layers":[
         {
            "class_name":"InputLayer",
            "config":{
               "batch_input_shape":[
                  null,
                  100,
                  120,
                  3
               ],
               "dtype":"float32",
               "sparse":false,
               "ragged":false,
               "name":"input_2"
            },
            "name":"input_2",
            "inbound_nodes":[
               
            ]
         },
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d_3",
               "trainable":true,
               "dtype":"float32",
               "filters":32,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "groups":1,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "name":"conv2d_3",
            "inbound_nodes":[
               [
                  [
                     "input_2",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d_3",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            },
            "name":"max_pooling2d_3",
            "inbound_nodes":[
               [
                  [
                     "conv2d_3",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d_4",
               "trainable":true,
               "dtype":"float32",
               "filters":64,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "groups":1,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "name":"conv2d_4",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_3",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d_4",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            },
            "name":"max_pooling2d_4",
            "inbound_nodes":[
               [
                  [
                     "conv2d_4",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Conv2D",
            "config":{
               "name":"conv2d_5",
               "trainable":true,
               "dtype":"float32",
               "filters":64,
               "kernel_size":[
                  3,
                  3
               ],
               "strides":[
                  1,
                  1
               ],
               "padding":"valid",
               "data_format":"channels_last",
               "dilation_rate":[
                  1,
                  1
               ],
               "groups":1,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "name":"conv2d_5",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_4",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"MaxPooling2D",
            "config":{
               "name":"max_pooling2d_5",
               "trainable":true,
               "dtype":"float32",
               "pool_size":[
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  2,
                  2
               ],
               "data_format":"channels_last"
            },
            "name":"max_pooling2d_5",
            "inbound_nodes":[
               [
                  [
                     "conv2d_5",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Flatten",
            "config":{
               "name":"flatten_1",
               "trainable":true,
               "dtype":"float32",
               "data_format":"channels_last"
            },
            "name":"flatten_1",
            "inbound_nodes":[
               [
                  [
                     "max_pooling2d_5",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_2",
               "trainable":true,
               "dtype":"float32",
               "units":1024,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "name":"dense_2",
            "inbound_nodes":[
               [
                  [
                     "flatten_1",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_3",
               "trainable":true,
               "dtype":"float32",
               "units":40,
               "activation":"softmax",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{
                     
                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "name":"dense_3",
            "inbound_nodes":[
               [
                  [
                     "dense_2",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         },
         {
            "class_name":"Reshape",
            "config":{
               "name":"reshape_1",
               "trainable":true,
               "dtype":"float32",
               "target_shape":[
                  4,
                  10
               ]
            },
            "name":"reshape_1",
            "inbound_nodes":[
               [
                  [
                     "dense_3",
                     0,
                     0,
                     {
                        
                     }
                  ]
               ]
            ]
         }
      ],
      "input_layers":[
         [
            "input_2",
            0,
            0
         ]
      ],
      "output_layers":[
         [
            "reshape_1",
            0,
            0
         ]
      ]
   },
   "keras_version":"2.4.0",
   "backend":"tensorflow"
}